{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "740a69c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0:00:03.617098\n"
     ]
    }
   ],
   "source": [
    "from pyspark.sql import SparkSession\n",
    "from pyspark.sql import SQLContext\n",
    "import datetime\n",
    "\n",
    "# Start spark session\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "spark = SparkSession \\\n",
    "    .builder\\\n",
    "    .appName(\"Anime importer\") \\\n",
    "    .master(\"spark://spark-master:7077\") \\\n",
    "    .config(\"spark.driver.memory\", \"15g\") \\\n",
    "    .config(\"spark.jars\", \"/extra_jars/neo4j-connector-apache-spark_2.12-4.0.1_for_spark_3.jar\") \\\n",
    "    .config(\"neo4j.url\", \"bolt://neo4j:7687\")\\\n",
    "    .config(\"neo4j.authentication.type\", \"basic\")\\\n",
    "    .config(\"neo4j.authentication.basic.username\", \"neo4j\")\\\n",
    "    .config(\"neo4j.authentication.basic.password\", \"password\")\\\n",
    "    .getOrCreate()\n",
    "\n",
    "print(datetime.datetime.now()-startTime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ac64868f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Csv users = 108712\n",
      "root\n",
      " |-- username: string (nullable = true)\n",
      " |-- user_id: integer (nullable = true)\n",
      " |-- user_watching: integer (nullable = true)\n",
      " |-- user_completed: integer (nullable = true)\n",
      " |-- user_onhold: integer (nullable = true)\n",
      " |-- user_dropped: integer (nullable = true)\n",
      " |-- user_plantowatch: integer (nullable = true)\n",
      " |-- user_days_spent_watching: double (nullable = true)\n",
      " |-- gender: string (nullable = true)\n",
      " |-- location: string (nullable = true)\n",
      " |-- birth_date: string (nullable = true)\n",
      " |-- access_rank: string (nullable = true)\n",
      " |-- join_date: string (nullable = true)\n",
      " |-- last_online: string (nullable = true)\n",
      " |-- stats_mean_score: string (nullable = true)\n",
      " |-- stats_rewatched: string (nullable = true)\n",
      " |-- stats_episodes: double (nullable = true)\n",
      "\n",
      "-RECORD 0---------------------------------------\n",
      " username                 | karthiga            \n",
      " user_id                  | 2255153             \n",
      " user_watching            | 3                   \n",
      " user_completed           | 49                  \n",
      " user_onhold              | 1                   \n",
      " user_dropped             | 0                   \n",
      " user_plantowatch         | 0                   \n",
      " user_days_spent_watching | 55.09166666666667   \n",
      " gender                   | Female              \n",
      " location                 | Chennai, India      \n",
      " birth_date               | 1990-04-29 00:00:00 \n",
      " access_rank              | null                \n",
      " join_date                | 2013-03-03 00:00:00 \n",
      " last_online              | 2014-02-04 01:32:00 \n",
      " stats_mean_score         | 7.43                \n",
      " stats_rewatched          | 0.0                 \n",
      " stats_episodes           | 3391.0              \n",
      "only showing top 1 row\n",
      "\n",
      "0:00:08.152396\n",
      "0:00:04.073273\n"
     ]
    }
   ],
   "source": [
    "# read users\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "data_file = '/import/anime/users_cleaned.csv' \n",
    "\n",
    "users = spark.read.csv(data_file, header=True, sep=\",\", inferSchema=True).cache()\n",
    "print('Csv users = {}'.format(users.count()))\n",
    "users.printSchema()\n",
    "users.show(1, vertical=True)\n",
    "\n",
    "print(datetime.datetime.now()-startTime)\n",
    "\n",
    "# write users to neo4j\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "users.write.format(\"org.neo4j.spark.DataSource\") \\\n",
    "    .option(\"node.keys\", \"username\")\\\n",
    "    .option(\"schema.optimization.type\", \"INDEX\")\\\n",
    "    .mode(\"Overwrite\")\\\n",
    "    .option(\"labels\", \":User\") \\\n",
    "    .save()\n",
    "\n",
    "print(datetime.datetime.now()-startTime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "d699a098",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total Records = 6668\n",
      "root\n",
      " |-- anime_id: integer (nullable = true)\n",
      " |-- title: string (nullable = true)\n",
      " |-- title_english: string (nullable = true)\n",
      " |-- title_japanese: string (nullable = true)\n",
      " |-- title_synonyms: string (nullable = true)\n",
      " |-- image_url: string (nullable = true)\n",
      " |-- type: string (nullable = true)\n",
      " |-- source: string (nullable = true)\n",
      " |-- episodes: string (nullable = true)\n",
      " |-- status: string (nullable = true)\n",
      " |-- airing: string (nullable = true)\n",
      " |-- aired_string: string (nullable = true)\n",
      " |-- aired: string (nullable = true)\n",
      " |-- duration: string (nullable = true)\n",
      " |-- rating: string (nullable = true)\n",
      " |-- score: string (nullable = true)\n",
      " |-- scored_by: string (nullable = true)\n",
      " |-- rank: double (nullable = true)\n",
      " |-- popularity: double (nullable = true)\n",
      " |-- members: double (nullable = true)\n",
      " |-- favorites: integer (nullable = true)\n",
      " |-- background: string (nullable = true)\n",
      " |-- premiered: string (nullable = true)\n",
      " |-- broadcast: string (nullable = true)\n",
      " |-- related: string (nullable = true)\n",
      " |-- producer: string (nullable = true)\n",
      " |-- licensor: string (nullable = true)\n",
      " |-- studio: string (nullable = true)\n",
      " |-- genre: string (nullable = true)\n",
      " |-- opening_theme: string (nullable = true)\n",
      " |-- ending_theme: string (nullable = true)\n",
      " |-- duration_min: string (nullable = true)\n",
      " |-- aired_from_year: string (nullable = true)\n",
      "\n",
      "-RECORD 0-------------------------------\n",
      " anime_id        | 11013                \n",
      " title           | Inu x Boku SS        \n",
      " title_english   | Inu X Boku Secret... \n",
      " title_japanese  | 妖狐×僕SS            \n",
      " title_synonyms  | Youko x Boku SS      \n",
      " image_url       | https://myanimeli... \n",
      " type            | TV                   \n",
      " source          | Manga                \n",
      " episodes        | 12                   \n",
      " status          | Finished Airing      \n",
      " airing          | False                \n",
      " aired_string    | Jan 13, 2012 to M... \n",
      " aired           | {'from': '2012-01... \n",
      " duration        | 24 min. per ep.      \n",
      " rating          | PG-13 - Teens 13 ... \n",
      " score           | 7.63                 \n",
      " scored_by       | 139250               \n",
      " rank            | 1274.0               \n",
      " popularity      | 231.0                \n",
      " members         | 283882.0             \n",
      " favorites       | 2809                 \n",
      " background      | Inu x Boku SS was... \n",
      " premiered       | Winter 2012          \n",
      " broadcast       | Fridays at Unknown   \n",
      " related         | {'Adaptation': [{... \n",
      " producer        | Aniplex, Square E... \n",
      " licensor        | Sentai Filmworks     \n",
      " studio          | David Production     \n",
      " genre           | Comedy, Supernatu... \n",
      " opening_theme   | \"['\"\"Nirvana\"\" by... \n",
      " ending_theme    | \"['#1: \"\"Nirvana\"... \n",
      " duration_min    |  11-12)'             \n",
      " aired_from_year |  '#2: \"\"Rakuen no... \n",
      "only showing top 1 row\n",
      "\n",
      "0:00:01.003258\n",
      "0:00:01.334324\n"
     ]
    }
   ],
   "source": [
    "# read animes\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "data_file = '/import/anime/anime_cleaned.csv' \n",
    "\n",
    "animes = spark.read.csv(data_file, header=True, sep=\",\", inferSchema=True).cache() \n",
    "print('Total Records = {}'.format(animes.count()))\n",
    "animes.printSchema()\n",
    "animes.show(1, vertical=True)\n",
    "\n",
    "print(datetime.datetime.now()-startTime)\n",
    "\n",
    "# write animes to neo4j\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "animes.write.format(\"org.neo4j.spark.DataSource\") \\\n",
    "    .option(\"node.keys\", \"anime_id\")\\\n",
    "    .option(\"schema.optimization.type\", \"INDEX\")\\\n",
    "    .mode(\"Overwrite\")\\\n",
    "    .option(\"labels\", \":Anime\") \\\n",
    "    .save()\n",
    "\n",
    "print(datetime.datetime.now()-startTime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "9dfa9a53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- username: string (nullable = true)\n",
      " |-- anime_id: integer (nullable = true)\n",
      " |-- my_watched_episodes: integer (nullable = true)\n",
      " |-- my_start_date: string (nullable = true)\n",
      " |-- my_finish_date: string (nullable = true)\n",
      " |-- my_score: integer (nullable = true)\n",
      " |-- my_status: integer (nullable = true)\n",
      " |-- my_rewatching: double (nullable = true)\n",
      " |-- my_rewatching_ep: integer (nullable = true)\n",
      " |-- my_last_updated: timestamp (nullable = true)\n",
      " |-- my_tags: string (nullable = true)\n",
      "\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "|username|anime_id|my_watched_episodes|my_start_date|my_finish_date|my_score|my_status|my_rewatching|my_rewatching_ep|    my_last_updated|my_tags|\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "|karthiga|      21|                586|   0000-00-00|    0000-00-00|       9|        1|         null|               0|2013-03-03 10:52:53|   null|\n",
      "|karthiga|      59|                 26|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-03-10 13:54:51|   null|\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "only showing top 2 rows\n",
      "\n",
      "Records read = 31279481\n",
      "0:00:45.569248\n"
     ]
    }
   ],
   "source": [
    "# get schema\n",
    "sample_file = '/import/anime/animelists_cleaned_sample.csv' \n",
    "\n",
    "sample = (spark.read.csv(sample_file, \n",
    "                         header=True, \n",
    "                         sep=\",\", \n",
    "                         ignoreLeadingWhiteSpace=True, \n",
    "                         ignoreTrailingWhiteSpace=True, \n",
    "                         dateFormat=\"yyyy-MM-dd\", \n",
    "                         timestampFormat=\"yyyy-MM-dd HH:mm:ss\",\n",
    "                         inferSchema=True\n",
    "                         ).cache())\n",
    "sample.printSchema()\n",
    "\n",
    "# read relationships\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "data_file = '/import/anime/animelists_cleaned.csv' \n",
    "\n",
    "relationships = (spark.read.csv(data_file, \n",
    "                               header=True, \n",
    "                               sep=\",\", \n",
    "                               ignoreLeadingWhiteSpace=True, \n",
    "                               ignoreTrailingWhiteSpace=True, \n",
    "                               dateFormat=\"yyyy-MM-dd\",\n",
    "                               timestampFormat=\"yyyy-MM-dd HH:mm:ss\",\n",
    "                               schema=sample.schema, \n",
    "                               mode=\"DROPMALFORMED\"\n",
    "                               ).cache())\n",
    "relationships.show(2)\n",
    "\n",
    "print('Records read = {}'.format(relationships.count()))\n",
    "print(datetime.datetime.now()-startTime)\n",
    "\n",
    "previousDbSize=(spark.read.format(\"org.neo4j.spark.DataSource\")\n",
    " .option(\"url\", \"bolt://neo4j:7687\")\n",
    " .option(\"query\", \"MATCH (n) RETURN n\")\n",
    " .load().count())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "9026616a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "|username|anime_id|my_watched_episodes|my_start_date|my_finish_date|my_score|my_status|my_rewatching|my_rewatching_ep|    my_last_updated|my_tags|\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "|karthiga|      21|                586|   0000-00-00|    0000-00-00|       9|        1|         null|               0|2013-03-03 10:52:53|   null|\n",
      "|karthiga|      59|                 26|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-03-10 13:54:51|   null|\n",
      "|karthiga|      74|                 26|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-04-27 16:43:35|   null|\n",
      "|karthiga|     120|                 26|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-03-03 10:53:57|   null|\n",
      "|karthiga|     178|                 26|   0000-00-00|    0000-00-00|       7|        2|          0.0|               0|2013-03-27 15:59:13|   null|\n",
      "|karthiga|     210|                161|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-03-10 13:57:06|   null|\n",
      "|karthiga|     232|                 70|   0000-00-00|    0000-00-00|       6|        2|         null|               0|2013-03-09 17:24:42|   null|\n",
      "|karthiga|     233|                 78|   0000-00-00|    0000-00-00|       6|        2|         null|               0|2013-03-10 05:29:44|   null|\n",
      "|karthiga|     249|                167|   0000-00-00|    0000-00-00|       8|        2|         null|               0|2013-03-19 16:04:46|   null|\n",
      "|karthiga|     269|                366|   0000-00-00|    0000-00-00|      10|        2|         null|               0|2013-03-03 09:39:23|   null|\n",
      "|karthiga|     721|                 38|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-04-27 16:23:53|   null|\n",
      "|karthiga|     853|                 26|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-03-10 13:57:27|   null|\n",
      "|karthiga|     857|                 25|   0000-00-00|    0000-00-00|      10|        2|          0.0|               0|2013-03-03 13:19:55|   null|\n",
      "|karthiga|     957|                 39|   0000-00-00|    0000-00-00|       8|        2|         null|               0|2013-04-27 16:34:18|   null|\n",
      "|karthiga|     966|                506|   0000-00-00|    0000-00-00|      10|        1|         null|               0|2013-03-10 14:29:59|   null|\n",
      "|karthiga|    1557|                 26|   0000-00-00|    0000-00-00|       8|        2|         null|               0|2013-05-05 14:38:12|   null|\n",
      "|karthiga|    1571|                 25|   0000-00-00|    0000-00-00|       8|        2|         null|               0|2013-04-27 16:31:37|   null|\n",
      "|karthiga|    1579|                 25|   0000-00-00|    0000-00-00|       9|        2|         null|               0|2013-04-27 16:44:33|   null|\n",
      "|karthiga|    1698|                 23|   0000-00-00|    0000-00-00|       7|        2|         null|               0|2013-04-27 16:14:27|   null|\n",
      "|karthiga|    1735|                303|   0000-00-00|    0000-00-00|       9|        1|         null|               0|2013-03-10 13:37:49|   null|\n",
      "+--------+--------+-------------------+-------------+--------------+--------+---------+-------------+----------------+-------------------+-------+\n",
      "only showing top 20 rows\n",
      "\n",
      "Repartitioning took 0:00:03.844707\n",
      "Inserted Records = 0\n",
      "1:10:46.220079\n"
     ]
    }
   ],
   "source": [
    "# repartition\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "# https://neo4j.com/developer/spark/faq/#_my_writes_are_failing_due_to_deadlock_exceptions\n",
    "partitioned = relationships.repartition(1, \"username\", \"anime_id\") \n",
    "print(partitioned.rdd.getNumPartitions())\n",
    "partitioned.show()\n",
    "\n",
    "\n",
    "print('Repartitioning took {}'.format(datetime.datetime.now()-startTime))\n",
    "\n",
    "# write relationships to neo4j\n",
    "startTime = datetime.datetime.now()\n",
    "\n",
    "(partitioned.write.format(\"org.neo4j.spark.DataSource\") \n",
    "    .mode(\"Overwrite\")\n",
    "#     .option(\"batch.size\", 40000) # bigger size is less transactional overhead == faster, but watch for out of memory errors\n",
    "    .option(\"relationship.properties\", \"my_watched_episodes,my_start_date,my_finish_date,my_score,my_status,my_rewatching,my_rewatching_ep,my_last_updated,my_tags\")\n",
    "    .option(\"relationship\", \"WATCHED\") \n",
    "    .option(\"relationship.save.strategy\", \"keys\") \n",
    "    .option(\"relationship.source.save.mode\", \"Match\")\n",
    "    .option(\"relationship.source.labels\", \":User\")\n",
    "    .option(\"relationship.source.node.keys\", \"username\")\n",
    "    .option(\"relationship.target.save.mode\", \"Match\")\n",
    "    .option(\"relationship.target.labels\", \":Anime\")\n",
    "    .option(\"relationship.target.node.keys\", \"anime_id\")\n",
    "    .save())\n",
    "\n",
    "currentDbSize=(spark.read.format(\"org.neo4j.spark.DataSource\")\n",
    " .option(\"url\", \"bolt://neo4j:7687\")\n",
    " .option(\"query\", \"MATCH (n) RETURN n\")\n",
    " .load().count())\n",
    "\n",
    "insertCount = previousDbSize-currentDbSize\n",
    "print('Inserted Records = {}'.format(insertCount))\n",
    "print(datetime.datetime.now()-startTime)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "224e4553",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "45e6bba9",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  },
  "toc-autonumbering": true,
  "toc-showcode": true,
  "toc-showmarkdowntxt": true,
  "toc-showtags": false
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
